/*=============================================================================
  じゃんけんプログラム
  https://qiita.com/tsuyopon_xyz/items/ed2e244da8225eb31b68 をもとに改変
=============================================================================*/

/*-----------------------------------------------------------------------------
 先頭に「'use strict';」と書くことで、潜在的なバグを減らす。
-----------------------------------------------------------------------------*/
'use strict';

/*-----------------------------------------------------------------------------
  イベントリスナの設定
-----------------------------------------------------------------------------*/
// 開始ボタンを押されるとゲーム開始
const playButton  = document.getElementById("play");
playButton.addEventListener('click', jankenHandler);

/*-----------------------------------------------------------------------------
  メイン処理
-----------------------------------------------------------------------------*/
// player の手を取得
const jankenInputBox = document.getElementById("janken_number");
let player = parseInt(jankenInputBox.value);

// conputer の手を設定
let computer = 0; // グー

/*-----------------------------------------------------------------------------
  じゃんけんの勝ち負けの結果を表示する関数
-----------------------------------------------------------------------------*/
function jankenHandler(event) {
  if (player === 0) {   // === は「等価演算子」です。「等しい」ことを調べます。
    alert("あいこです!");        // プレイヤーがグーの時に行う処理を記します。
                                 // ここでは、alert文を使い、画面表示します。
  } else if (player === 1) {     // プレイヤーがチョキの時なら
    alert("あなたの負けです!");
  } else if (player === 2) {     // プレイヤーがパーの時なら
    alert("あなたの勝ちです!");
  }
}
